---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalSetting
source: html/d0c5bb12-7cf7-35e0-fc72-51e491c56bc2.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting

The ElectricalSetting class represents an instance of element of electrical settings.

## Syntax (C#)
```csharp
public class ElectricalSetting : Element
```